; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_3 type_1)
 (:predicates (pred_3 ?v1 - type_3 ?v8 - type_2)
 	      (pred_4 ?v2 - object ?v8 - type_2)
	      (pred_1 ?v1 - type_3 ?v7 - type_1)
	      (pred_2 ?v1 - type_3 ?v2 - object ?v7 - type_1))

   (:action op_2
       :parameters  (?v1 - type_3 ?v4 ?v5 - type_2)
       :precondition (and  (pred_3 ?v1 ?v4))
       :effect (and  (pred_3 ?v1 ?v5)
		     (not (pred_3 ?v1 ?v4))))

   (:action op_1
       :parameters (?v1 - type_3 ?v6 - object ?v3 - type_2 ?v7 - type_1)
       :precondition  (and  (pred_4 ?v6 ?v3) (pred_3 ?v1 ?v3) (pred_1 ?v1 ?v7))
       :effect (and (pred_2 ?v1 ?v6 ?v7)
		    (not (pred_4 ?v6 ?v3)) 
		    (not (pred_1 ?v1 ?v7))))

   (:action op_3
       :parameters (?v1 - type_3 ?v6 - object ?v3 - type_2 ?v7 - type_1)
       :precondition  (and  (pred_2 ?v1 ?v6 ?v7) (pred_3 ?v1 ?v3))
       :effect (and (pred_4 ?v6 ?v3)
		    (pred_1 ?v1 ?v7)
		    (not (pred_2 ?v1 ?v6 ?v7)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_13 obj_09 - type_3
obj_08 obj_03 obj_07 obj_14 - type_1
obj_02 obj_01 obj_04 obj_06 - type_2
obj_05 obj_11 obj_10 obj_12 - object)
(:init
(pred_3 obj_13 obj_06)
(pred_1 obj_13 obj_08)
(pred_1 obj_13 obj_03)
(pred_3 obj_09 obj_01)
(pred_1 obj_09 obj_07)
(pred_1 obj_09 obj_14)
(pred_4 obj_05 obj_01)
(pred_4 obj_11 obj_04)
(pred_4 obj_10 obj_06)
(pred_4 obj_12 obj_02)
)
(:goal
(and
(pred_4 obj_05 obj_02)
(pred_4 obj_11 obj_01)
(pred_4 obj_10 obj_02)
(pred_4 obj_12 obj_06)
)
)

(:constraints
  (always (not (pred_3 obj_13 obj_04)))
)
)

; plan
1. (op_1 obj_09 obj_05 obj_01 obj_14)
   deleted: (pred_4 obj_05 obj_01) (pred_1 obj_09 obj_14)
   added: (pred_2 obj_09 obj_05 obj_14)
   goals met: 0 of 4
2. (op_1 obj_13 obj_10 obj_06 obj_03)
   deleted: (pred_4 obj_10 obj_06) (pred_1 obj_13 obj_03)
   added: (pred_2 obj_13 obj_10 obj_03)
   goals met: 0 of 4
3. (op_2 obj_09 obj_01 obj_02)
   deleted: (pred_3 obj_09 obj_01)
   added: (pred_3 obj_09 obj_02)
   goals met: 0 of 4
4. (op_2 obj_13 obj_06 obj_02)
   deleted: (pred_3 obj_13 obj_06)
   added: (pred_3 obj_13 obj_02)
   goals met: 0 of 4
5. (op_3 obj_09 obj_05 obj_02 obj_14)
   deleted: (pred_2 obj_09 obj_05 obj_14)
   added: (pred_4 obj_05 obj_02) (pred_1 obj_09 obj_14)
   goals met: 1 of 4
6. (op_3 obj_13 obj_10 obj_02 obj_03)
   deleted: (pred_2 obj_13 obj_10 obj_03)
   added: (pred_4 obj_10 obj_02) (pred_1 obj_13 obj_03)
   goals met: 2 of 4
7. (op_1 obj_13 obj_12 obj_02 obj_08)
   deleted: (pred_4 obj_12 obj_02) (pred_1 obj_13 obj_08)
   added: (pred_2 obj_13 obj_12 obj_08)
   goals met: 2 of 4
8. (op_2 obj_13 obj_02 obj_06)
   deleted: (pred_3 obj_13 obj_02)
   added: (pred_3 obj_13 obj_06)
   goals met: 2 of 4
9. (op_2 obj_09 obj_02 obj_04)
   deleted: (pred_3 obj_09 obj_02)
   added: (pred_3 obj_09 obj_04)
   goals met: 2 of 4
10. (op_3 obj_13 obj_12 obj_06 obj_08)
   deleted: (pred_2 obj_13 obj_12 obj_08)
   added: (pred_4 obj_12 obj_06) (pred_1 obj_13 obj_08)
   goals met: 3 of 4
11. (op_1 obj_09 obj_11 obj_04 obj_14)
   deleted: (pred_4 obj_11 obj_04) (pred_1 obj_09 obj_14)
   added: (pred_2 obj_09 obj_11 obj_14)
   goals met: 3 of 4
12. (op_2 obj_09 obj_04 obj_01)
   deleted: (pred_3 obj_09 obj_04)
   added: (pred_3 obj_09 obj_01)
   goals met: 3 of 4
13. (op_3 obj_09 obj_11 obj_01 obj_14)
   deleted: (pred_2 obj_09 obj_11 obj_14)
   added: (pred_4 obj_11 obj_01) (pred_1 obj_09 obj_14)
   goals met: 4 of 4
